# Задача 2: Найдите сумму цифр трехзначного числа.

num1 = int(input("Введите 1-ю цифру: "))
num2 = int(input("Введите 2-ю цифру: "))
num3 = int(input("Введите 3-ю цифру: "))
sum = (num1 + num2 + num3)
print(sum)
