# Задача.4

x = int(input('Веедите число журавликов:'))
if x % 6 == 0:
    print(f'{x//6}  {x//3*2}  {x//6}')
else:
    print('Нет целочисленного решения')
